import 'package:flutter/material.dart';

class Data {
  static List zikrlarArab = [
    "سبحان الله",
    "الحمد لله",
    "الله اكبر",
    "أستغفر الله",
    "لا إله إلا الله محمد رسول الله",
    "سبحان الله وبحمده، سبحان اللهالعظيم",
    "لا حول ولا قوة الابالله",
    "اللَّهُمَّ إنِّي أَسْأَلُك الْجَنَّةَ وَأَعُوذُ بِكَ مِنَ النَّارِ",
    "اللهم صل على سيدنامحمد",
  ];

  static List zikrlarOzbek = [
    "Subhanalloh",
    "Alhamdulillah",
    "Allohu Akbar",
    "Astagfirulloh",
    "La Ilaha Illalloh Muhammadur Rosululloh",
    "Subhanallohi Va Bihamdihi, Subhanallohil 'Azim",
    "La havla vala quvvaqa illa billah",
    "Allohumma Inniy As'alukal Jannata Va A'uzubika Minan Naar",
    "Allohumma Solli 'Ala Sayyidina Muhammad",
  ];

  static List duo = [
    """Абу Ҳурайра розияллоҳу анҳудан ривоят қилинади: Расулуллоҳ соллаллоҳу алайҳи васаллам: «Ким эрталаб ёки кечқурун:
سُبْحَانَ اللهِ وَبِحَمْدِهِ
«Субҳаналлоҳи ва биҳамдиҳи», (Аллоҳга ҳамд айтиш билан Уни айбу нуқсонлардан поклаб ёд этаман), деб юз марта айтса, қиёмат куни бирор киши ундан афзал бўлмайди. Фақат ана шу киши айтганидек ёки ундан ошириб айтсагина, бўлиши мумкин», дедилар.
Имом Муслим ривоятлари.
Абу Довуднинг ривоятларида:
سُبْحَانَ اللهِ العَظِيمِ وَبِحَمْدِهِ
«Субҳаналлоҳил ъазийм ва биҳамдиҳи», деб келган. Расулуллоҳ соллаллоҳу алайҳи васаллам қизларининг биридан ривоят қилинади. У зот қизларига тонг отганида:
سُبْحَانَ اللهِ وَبِحَمْدِهِ لاَ قُوَّةَ إِلاَّ بِاللهِ مَا شَاءَ اللهُ كَانَ وَمَا لَمْ يَشَأْ لَمْ يَكُنْ، أَعْلَمُ أَنَّ اللهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، وَأَنَّ اللهَ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا
«Субҳаналлоҳи ва биҳамдиҳи, ла қуввата илла биллаҳи маша`аллоҳу кана ва ма лам йаша` лам йакун. Аъламу анналлоҳа ъала кулли шай`ин қодийр. Ва анналлоҳа қод аҳато бикулли шай`ин ъилма», деб айтишни ўргатар эдилар. Чунки бу калималарни тонг отганида айтган киши кеч киргунича муҳофаза қилинади. Кеч кирганида айтса, тонг отгунича муҳофаза этилади. (Маъноси: Аллоҳга ҳамд айтиш билан Уни поклаб ёд этаман. Аллоҳдан бошқада қувват йўқ. Аллоҳ хоҳлаган нарса бўлади. Хоҳламаган нарса бўлмайди. Биламанки, Аллоҳ ҳар бир нарсага қодирдир. Ва, албатта, Аллоҳ ҳар бир нарсани илми билан иҳота қилгандир.)
""",
    """Анас розияллоҳу анҳудан ривоят қилинади: Расулуллоҳ соллаллоҳу алайҳи васаллам: «Ким жума куни бомдод намозидан олдин:
أسْتَغْفِرُ اللهَ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ القَيُّومُ وَأَتُوبُ إِلَيْهِ
«Астағфируллоҳаллазий ла илаҳа илла ҳувал ҳаййул қоййум ва атубу илайҳ», деб уч марта айтса, Аллоҳ таоло унинг гуноҳларини денгиз кўпигича бўлса ҳам, кечириб юборади», дедилар. (Маъноси: Ҳай ва қаййум сифатли Зотдан бошқа илоҳ йўқ ва Унга истиғфор айтаман, Унга тавба қиламан.)
""",
    """Абу Ҳурайра розияллоҳу анҳудан ривоят қилинади: Расулуллоҳ соллаллоҳу алайҳи васаллам: «Киши тўшакка ётаётганида кўрпа ва изорини қоқиб ташласин. Чунки унинг орасида нима борлигини билмайди. Сўнг:
بِاسْمِكَ رَبِّي وَضَعْتُ جَنْبِي وَبِكَ أَرْفَعُهُ إِنْ أَمْسَكْتَ نَفْسِي فَارْحَمْهَا وَإِنْ أرْسَلْتَهَا فَاحْفَظْهَا بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ
«Бисмика роббий вазоъту жамбий ва бика арфаъуҳу, ин амсакта нафсий фарҳамҳа ва ин арсалтаҳа фаҳфазҳа бима таҳфазу биҳи ъибадакас солиҳийн», деб айтсин», дедилар. (Маъноси: Эй Раббим, Сенинг исминг билан ётдим ва Сенинг исминг билан тураман. Агар менинг руҳимни олсанг, унга раҳм қил. Агар уни қўйиб юборсанг, худди солиҳ бандаларингни сақлаганингдек, уни ҳам ҳифзу ҳимоянгга ол.)
Имом Бухорий ва Муслим ривоятлари.
Оиша розияллоҳу анҳо айтадилар: «Расулуллоҳ соллаллоҳу алайҳи васаллам тўшакларига ётсалар, қўлларига суфлаб, иккита «Қул аъузу»ни ўқир, сўнг таналарига суртар эдилар».
Имом Бухорий ва Муслим ривоятлари.
""",
    """Зайд ибн Собит розияллоҳу анҳу айтадилар: «Расулуллоҳ соллаллоҳу алайҳи васалламга уйқусизликдан шикоят қилдим, у зот:
اللهُمَّ غَارَتِ النُّجُومُ وَهَدَأَتِ العُيُونُ وَأَنْتَ حَيٌّ قَيُّوم لاَ تَأْخُذُكَ سِنَةٌ وَلاَ نَومٌ يَا حَيُّ يَا قَيُّومُ أهْدِي لَيْلِي وَأنِمْ عَيْنِي
«Аллоҳумма ғоротин нужуму ва ҳада`атил ъуйуну ва анта ҳаййун қоййум, ла та`хузука синатун ва ла навм, йа ҳаййу, йа қоййуму, аҳдий лайлий ва аним ъайний, деб айт», дедилар. Шу дуони айтган эдим, Аллоҳ мендан уйқусизликни кетказди». (Маъноси: Аллоҳим, юлдузлар ботди, кўзлар тинди. Сен тирик, қоимдирсан. Сени мудроқ ҳам, уйқу ҳам олмайди. Эй Ҳай ва Қаййум сифатли Зот, кечамни тинч қилиб, кўзимга уйқу бер.)
Ибн Сунний ривоятлари.""",
    """Амр ибн Шуайб оталаридан, оталари боболаридан ривоят қиладилар. Расулуллоҳ соллаллоҳу алайҳи васаллам уйқусида қўрққанларга:
أعُوذُ بِكَلِمَاتِ اللهِ التَّامَّةِ مِنْ غََضَبِهِ وَشَرِّ عِبَادِهِ وَمِنْ هَمَزَاتِ الشَّيَاطِينِ وَأنْ يَحْضُرُونِ
«Аъузу бикалиматиллаҳит таммаҳ мин ғозабиҳи ва шарри ъибадиҳи ва мин ҳамазатиш шайатийни ва ан йаҳзуруни», деб айтишни ўргатганлар. (Маъноси: Аллоҳнинг мукаммал калималари билан Унинг ғазабидан, бандаларининг ёмонлигидан, шайтон ҳозир бўлиб, васваса қилишидан паноҳ тилайман.)
Абу Довуд, Термизий ва Ибн Суннийлар ривоятлари.""",
    """Ибн Суннийнинг ривоятларида Абу Ҳурайра розияллоҳу анҳу бундай деганлар: «Агар бирортангиз ўзи ёқтирмаган туш кўрса, уч марта туфлаб:
إِنِّي أعُوذُ بِكَ مِنْ عَمَلِ الشَّيْطَانِ وَسَيِّئَاتِ الأَحْلاَمِ
«Инний аъузу бика мин ъамалиш шайтони ва саййиатил аҳлами», деса, унга ҳеч нарса бўлмайди». (Маъноси: Мен шайтоннинг амалидан ва булғанган тушдан Сенинг исминг ила паноҳ тилайман.)""",
    """Ҳузайфа ибн Ямон розияллоҳу анҳу ва Абу Зарр розияллоҳу анҳудан ривоят қилинади. Расулуллоҳ соллаллоҳу алайҳи васаллам тўшакларига ётсалар,
بِاسْمِكَ اللهمَّ أَحْيَا وَأَمُوتُ
«Бисмикаллоҳумма аҳйа ва амуту», деб айтганлар. (Маъноси: Эй Раббим, Сенинг исминг билан тириламан ва ўламан.) Уйғонганларида:
الْحَمْدُ للهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ
«Алҳамду лиллаҳиллазий аҳйана баъда ма аматана ва илайҳин нушур», деб айтар эдилар. (Маъноси: Бизни ўлдиргандан кейин тирилтирган Аллоҳга ҳамд бўлсин. Ва биз Унгагина қайтамиз.)
Имом Бухорий ривоятлари.""",
    """Умар ибн Хаттоб розияллоҳу анҳудан ривоят қилинади: Расулуллоҳ соллаллоҳу алайҳи васаллам: «Ким таҳорат қилиб бўлиб:
أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ الله وَحْدَهُ لاَ شَرِيكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ
«Ашҳаду анла илаҳа иллаллоҳу ваҳдаҳу ла шарийка лаҳу ва ашҳаду анна Муҳаммадан ъабдуҳу ва росулуҳу», деса, унга жаннатнинг саккизта эшиги очилиб, хоҳлаганидан кираверади», дедилар.
Имом Муслим ривоятлари.""",
    """Ибн Аббос розияллоҳу анҳудан ривоят қилинади: У зот холалари Маймуна розияллоҳу анҳунинг уйларида тунаб қолганларида, Расулуллоҳ соллаллоҳу алайҳи васалламнинг қуйидаги ишларига гувоҳ бўлганини айтадилар: «Набий соллаллоҳу алайҳи васаллам муаззиннинг бомдодга айтган азонини эшитдилар, сўнг намозга кетатуриб, қуйидаги дуони ўқидилар:
اللهُمَّ اجْعِلْ فِي قَلْبِي نُورًا وَفِي لِسَانِي نُورًا وَاجْعَلْ فِي سَمْعِي نُورًا وَاجْعَلْ فِي بَصَرِي نُورًا وَاجْعَلْ مِنْ خَلْفِي نُورًا وَمِنْ أَمَامِي نُورًا وَاجْعَلْ مِنْ فَوقِي نُورًا وَمِنْ تَحْتِي نُورًا، اللهُمَّ اعْطِنِي نُورًا
«Аллоҳуммажъал фий қолбий нурон ва фий лисаний нурон важъал фий самъий нурон важъал фий басорий нурон важъал мин холфий нурон ва мин амамий нурон важъал мин фавқий нурон ва мин таҳтий нурон, Аллоҳуммаътиний нуро». (Маъноси: Эй Раббим, қалбимда нур қил, тилимда нур қил, қулоғимда нур қил, кўзимда нур қил, орқамдан нур қил, олдимдан нур қил, устимдан нур қил, остимдан нур қил, эй Раббим, менга нур ато эт).
Имом Муслим ривоятлари.""",
    """Абу Ҳумайд ёки Абу Усайдлардан ривоят қилинади: “Расулуллоҳ соллаллоҳу алайҳи васаллам айтдилар: «Агар бирортангиз масжидга кирса, Расулуллоҳ соллаллоҳу алайҳи васалламга салом айтиб, сўнг:
اللهُمَّ افْتَحْ لِي أبْوَابَ رَحْمَتِكَ
«Аллоҳуммафтаҳ лий абваба роҳматик», деб айтсин. (Маъноси: Эй Раббим, бизга раҳмат эшикларини очгин) Чиққанида эса:
اللهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ
«Аллоҳумма инний ас`алука мин фазлик», десин». (Маъноси: Эй Раббим, Сенинг фазлингни сўрайман.) Бу ҳадисни Имом Муслим ривоят қилганлар. Лекин у зотнинг ривоятларида «Расулуллоҳга салом айтсин», деган лафз йўқ.""",
    """Абу Саид Худрий розияллоҳу анҳудан ривоят қилинади: Расулуллоҳ соллаллоҳу алайҳи васаллам: «Азонни эшитганингларда муаззин нима деса, ўшани айтинглар», дедилар.
Имом Бухорий ва Муслим ривоятлари.
Азоннинг ҳаммасини эшитиб бўлганидан кейин Расулуллоҳга саловот айтиб, ортидан мана бу дуони ўқийди: Жобир розияллоҳу анҳудан ривоят қилинади: Расулуллоҳ соллаллоҳу алайҳи васаллам: Ким азонни эшитган пайтида
اللهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ وَالصَّلاَةِ القَائِمَةِ آتِ مُحَمَّدًا الوَسِيلَةَ وَالفَضِيلَةَ وَابْعَثْهُ مَقَامًا مُحْمُودًا الَّذِي وَعَدْتَهُ
«Аллоҳумма робба ҳазиҳид даъватит таммаҳ вассолатил қоимаҳ, ати Муҳаммаданил васийлата вал фазийлаҳ вабъасҳу мақомам маҳмуданиллазий ваъадтаҳ», деб айтса, Қиёмат куни унга шафоат бўлади”, дедилар. (Маъноси: Эй бу комил дуонинг ва қоим бўлган намознинг эгаси - Аллоҳим, Муҳаммадга васила ва фазилат бер, у зотни ваъда қилганинг мақтовли мақомда тирилтир), деб сўнгра хоҳлаганича дунёвий ва ухровий дуоларни қилаверади.)
Абу Довуд ривоятлари.""",
    """Оиша онамиз розияллоҳу анҳодан ривоят қилинади: Расулуллоҳ соллаллоҳу алайҳи васаллам намозни бошласалар:
سُبْحَانَكَ اللهُمَّ وَبِحَمْدِكَ وَتَبَارَكَ اسْمُكَ وَتَعَالى جَدُّكَ وَلاَ إِلَهَ غَيْرُكَ
«Субҳанакаллоҳумма ва биҳамдика ва табарокасмука ва таъала жаддука ва ла илаҳа ғойрук», дер эдилар. (Маъноси: Эй Раббим, Сенга ҳамд айтиш билан Сени айбу нуқсонлардан поклайман. Сенинг исминг муборакдир. Азаматинг олийдир. Сендан бошқа илоҳ йўқдир.)""",
  ];

  static List duoNom = [
    "Tong va kechqurunda",
    "Juma tongida",
    "Uxlash uchun to'shakka yotganda",
    "Bezovta bo'lib uxlay olmaganda",
    "Uyquda qo'rqqanda",
    "Tushida yoqtirmagan narsani ko'rganda",
    "Uyqudan uyg'onganda",
    "Tahorat qilganda",
    "Masjidga ketayotganda",
    "Masjidga kirayotganda va undan chiqayotganda",
    "Azon va iqomatni eshitganda",
    "Namoz boshlaganda",
  ];

  static List suralar = [
    "بِسْمِ ٱللَّهِ ٱلرَّحْمَـٰنِ ٱلرَّحِيمِ ",
  ];
  static List suraNom = ["Fotiha Surasi"];

  static List beshUstun = [
    "Kalimai Shaxodat",
    "Namoz O'qish",
    "Ro'za Tutish",
    "Zakot Berish",
    "Imkoni Bo'lsa Haj Qilish",
  ];

  
}
